app/views/bands/show.html.erb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<p>
  Band: <%= Band.find(params[:id]).name %>