app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE (1) LIMIT $1  [["LIMIT", 1]]
---
  def show
    @bands = Band.find_by(params[:name])