app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "a@a"], ["LIMIT", 1]]
---
  def find_by_credentials(email,pw)
    user = User.find_by(email: email)